//****************************************//
//                                        //
//  (速度)|        ／                     //
//        |      ／b.                     //
//       v|....／....                     //
//        |a ／.    .                     //
//      vo|／c . d  .                     //
//        |____.____.___                  //
//             t   2t  (時間)             //
//                                        //
//   所求等於  c+b+d = a+c+d = v*2t       //
//****************************************//
#include <iostream>
using namespace std;
int main()
{
    int v,t;
    while(cin>>v>>t)
    {
        cout<<v*t*2<<endl;
    }
    return 0;
}
